Tutorial/20230212210450-libvirt_clipboard.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>libvirt clipboard</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">libvirt clipboard</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4367c9a">How to use the clipboard in libvirt&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span>&#xa0;<span class=""></span>&#xa0;<span class="vm">vm</span></span></a></li>
</ul>
</div>
</div>
<div id="outline-container-org4367c9a" class="outline-2">
<h2 id="org4367c9a">How to use the clipboard in libvirt&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span>&#xa0;<span class=""></span>&#xa0;<span class="vm">vm</span></span></h2>
<div class="outline-text-2" id="text-org4367c9a">
<p>
Make sure spice-vdagent is installed
Enable the service
</p>
<div class="org-src-container">
<pre class="src src-shell">systemctl enable spice-vdagentd.service<span style="font-weight: bold;">`</span>
</pre>
</div>

<p>
Add a new channel to the host
</p>

<p>
My issue it was on the wrong channel number
</p>
<div class="org-src-container">
<pre class="src src-xml">channel type="spicevmc"
target type="virtio"
name="com.redhat.spice.0"
alias name="channel0"
address type="virtio-serial" controller="0" bus="0" port="2"
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"></p>
</div>
</body>
</html>
